# 시간 데이터로 집계하기 


<a href='https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.resample.html'> pandas 문서 참고 </a>

## Examples

In [1]:
import pandas as pd

### date_range( ) 함수로 날짜 데이터 만들기

In [5]:
# periods -> 연속된 수량
# freq = year,month, day, time ,week, quarter 
pd.date_range('1/1/2000', periods=9,freq='Y')

DatetimeIndex(['2000-12-31', '2001-12-31', '2002-12-31', '2003-12-31',
               '2004-12-31', '2005-12-31', '2006-12-31', '2007-12-31',
               '2008-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [6]:
pd.date_range('1/1/2000', periods=9,freq='M')

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-30'],
              dtype='datetime64[ns]', freq='M')

In [7]:
pd.date_range('1/1/2000', periods=9,freq='d')

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09'],
              dtype='datetime64[ns]', freq='D')

In [8]:
pd.date_range('1/1/2000', periods=9,freq='t')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 00:01:00',
               '2000-01-01 00:02:00', '2000-01-01 00:03:00',
               '2000-01-01 00:04:00', '2000-01-01 00:05:00',
               '2000-01-01 00:06:00', '2000-01-01 00:07:00',
               '2000-01-01 00:08:00'],
              dtype='datetime64[ns]', freq='T')

In [11]:
# dataframe 생성
index=pd.date_range('1/1/2000', periods=9,freq='t')
df=pd.DataFrame({
    'order':[10,13,20,25,45,60,30,20,22],
    'user' : [5,6,5,9,10,3,8,4,5]
},index=index)
df

                     order  user
2000-01-01 00:00:00     10     5
2000-01-01 00:01:00     13     6
2000-01-01 00:02:00     20     5
2000-01-01 00:03:00     25     9
2000-01-01 00:04:00     45    10
2000-01-01 00:05:00     60     3
2000-01-01 00:06:00     30     8
2000-01-01 00:07:00     20     4
2000-01-01 00:08:00     22     5

In [13]:
#3분단위로 집계되어 연산된것 확인
df.resample('3T').sum()

                     order  user
2000-01-01 00:00:00     43    16
2000-01-01 00:03:00    130    22
2000-01-01 00:06:00     72    17

In [14]:
df.resample('2T').sum()

                     order  user
2000-01-01 00:00:00     23    11
2000-01-01 00:02:00     45    14
2000-01-01 00:04:00    105    13
2000-01-01 00:06:00     50    12
2000-01-01 00:08:00     22     5

In [16]:
# 날짜는 한가지밖에 없어서 하나로 집계됨
df.resample('D').sum()

            order  user
2000-01-01    245    55

In [25]:
# data는 분단위로 되어 있어서 30초 단위에는 값이 없음
# asfreq: NaN 데이터 들어감
df.resample('30S').asfreq().head(10)

                     order  user
2000-01-01 00:00:00   10.0   5.0
2000-01-01 00:00:30    NaN   NaN
2000-01-01 00:01:00   13.0   6.0
2000-01-01 00:01:30    NaN   NaN
2000-01-01 00:02:00   20.0   5.0
2000-01-01 00:02:30    NaN   NaN
2000-01-01 00:03:00   25.0   9.0
2000-01-01 00:03:30    NaN   NaN
2000-01-01 00:04:00   45.0  10.0
2000-01-01 00:04:30    NaN   NaN

In [24]:
# pad: 앞의 데이터와 동일한 값 넣어줌
df.resample('30S').pad().head(10)

                     order  user
2000-01-01 00:00:00     10     5
2000-01-01 00:00:30     10     5
2000-01-01 00:01:00     13     6
2000-01-01 00:01:30     13     6
2000-01-01 00:02:00     20     5
2000-01-01 00:02:30     20     5
2000-01-01 00:03:00     25     9
2000-01-01 00:03:30     25     9
2000-01-01 00:04:00     45    10
2000-01-01 00:04:30     45    10

In [27]:
# bfill: 뒤에값 넣어줌
df.resample('30S').bfill().head(10)

                     order  user
2000-01-01 00:00:00     10     5
2000-01-01 00:00:30     13     6
2000-01-01 00:01:00     13     6
2000-01-01 00:01:30     20     5
2000-01-01 00:02:00     20     5
2000-01-01 00:02:30     25     9
2000-01-01 00:03:00     25     9
2000-01-01 00:03:30     45    10
2000-01-01 00:04:00     45    10
2000-01-01 00:04:30     60     3

### year to quarter of the period

In [30]:
s=pd.Series([1,2],index=pd.period_range('2019-01-01',periods=2,freq='A'))
s

2019    1
2020    2
Freq: A-DEC, dtype: int64

In [31]:
s.resample('Q').asfreq()

2019Q1    1.0
2019Q2    NaN
2019Q3    NaN
2019Q4    NaN
2020Q1    2.0
2020Q2    NaN
2020Q3    NaN
2020Q4    NaN
Freq: Q-DEC, dtype: float64

In [36]:
s.resample('M').asfreq()

2019-01    1.0
2019-02    NaN
2019-03    NaN
2019-04    NaN
2019-05    NaN
2019-06    NaN
2019-07    NaN
2019-08    NaN
2019-09    NaN
2019-10    NaN
2019-11    NaN
2019-12    NaN
2020-01    2.0
2020-02    NaN
2020-03    NaN
2020-04    NaN
2020-05    NaN
2020-06    NaN
2020-07    NaN
2020-08    NaN
2020-09    NaN
2020-10    NaN
2020-11    NaN
2020-12    NaN
Freq: M, dtype: float64

In [40]:
d = dict({'price': [10, 11, 9, 13, 14, 18, 17, 19],
          'volume': [50, 60, 40, 100, 50, 100, 40, 50]})
df = pd.DataFrame(d)

In [41]:
df.head()

   price  volume
0     10      50
1     11      60
2      9      40
3     13     100
4     14      50

### columns으로 resample 하고싶을 때

In [42]:
# freq = 'w' :week (7일)
df['week_starting'] = pd.date_range('01/01/2018',
                                    periods=8,
                                    freq='W')

In [43]:
df

   price  volume week_starting
0     10      50    2018-01-07
1     11      60    2018-01-14
2      9      40    2018-01-21
3     13     100    2018-01-28
4     14      50    2018-02-04
5     18     100    2018-02-11
6     17      40    2018-02-18
7     19      50    2018-02-25

In [50]:
import numpy as np
df.resample('M', on='week_starting').agg([np.sum,np.mean])

              price        volume
                sum   mean    sum  mean
week_starting
2018-01-31       43  10.75    250  62.5
2018-02-28       68  17.00    240  60.0